Public Attributes | List of all members
API_RGBColor Struct Reference
Dialog and Palette integration
RGB color reference. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | f_red
red component
double  | f_green
green component
double  | f_blue
blue component
Detailed Description
RGB color reference.
Remarks
Each component expressed in [0.0... 1.0] interval. The {0.0, 0.0, 0.0} components represents the black, {1.0, 1.0, 1.0} the white color.
Member Data Documentation
◆ f_blue
 API_RGBColor::f_blue
blue component
◆ f_green
 API_RGBColor::f_green
green component
◆ f_red
 API_RGBColor::f_red
red component